benchmarks/wsgi-test/cache.txt
This is ApacheBench, Version 2.3 <$Revision: 1757674 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.10.3
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /wsgi-test/?a=b&c=d
Document Length:        45 bytes

Concurrency Level:      1
Time taken for tests:   35.201 seconds
Complete requests:      16329
Failed requests:        0
Total transferred:      3788328 bytes
HTML transferred:       734805 bytes
Requests per second:    463.89 [#/sec] (mean)
Time per request:       2.156 [ms] (mean)
Time per request:       2.156 [ms] (mean, across all concurrent requests)
Transfer rate:          105.10 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.5      1      17
Processing:     0    0   0.4      0      33
Waiting:        0    0   0.3      0      33
Total:          0    1   0.7      1      34

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      2
  98%      2
  99%      3
 100%     34 (longest request)